import re

def to_abkai(manchu):
    pairs = [
            ("ᡝᠩ", "eng"),
            ("ᠩ", "ng"),
            ("ᡷᡳ", "jy"),
            ("ᡱ᠊ᡳ", "qy"),
            ("ᠰᡟ", "sy"),
            ("ᡰ᠊", "r"),
            ("ᡯᡳ᠌", "zy"),
            ("ᡯ᠊", "z"),
            ("ᡮᡟ", "cy"),
            ("ᡮ᠊", "c"),
            ("ᠸ", "w"),
            ("ᡶ", "f"),
            ("ᡵ", "r"),
            ("ᡭ᠊", "h"),
            ("ᡬ᠊", "g"),
            ("ᠺ᠊", "k"),
            ("ᡥ", "h"),
            ("ᡤ", "g"),
            ("ᡴ᠊", "k"),
            ("ᠶ", "y"),
            ("ᠵ", "j"),
            ("ᠴ", "q"),
            ("ᠮ", "m"),
            ("ᠯ", "l"),
            ("ᡩ", "d"),
            ("ᡨ", "t"),
            ("ᡧ", "x"),
            ("ᠰ", "s"),
            ("ᡦ᠊", "p"),
            ("ᠪ", "b"),
            ("ᡥ", "h"),
            ("ᡤ", "g"),
            ("ᡴ", "k"),
            ("ᠨ", "n"),
            ("ᡡ", "v"),
            ("ᡠ", "u"),
            ("ᠣ", "o"),
            ("ᡳ", "i"),
            ("ᡝ", "e"),
            ("ᠠ", "a"),
            ("᠈", ","),
            ("᠉", "."),
            ("eu", "eo"),
            ("ou", "oo"),
            ("iu", "io"),
            ]
    abkai = manchu
    for m, a in pairs:
        abkai = re.sub(m, a, abkai)
    return abkai

def to_norman(manchu):
    return to_abkai(manchu) #temp
